examples/scratch/OF_airfoil_shape_optimization/baseCase/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          288;
        startFace       45233;
    }
    outlet
    {
        type            patch;
        nFaces          158;
        startFace       45521;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          96;
        startFace       45679;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          45504;
        startFace       45775;
    }
)

// ************************************************************************* //
