examples/scratch/OF_airfoil_shape_optimization/baseCase/system/blockMeshDict
/*--------------------------------*Thien Phan*-------------------------------*\ 																
| =========                 |                                                 | 																
| \\      /  F ield         | OpenFOAM: phanquocthien.org                     |																
|  \\    /   O peration     | Files are generated by Thien Phan               | 																
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |																
|    \\/     M anipulation  |         PhanQuocThien@gmail.com                 | 																
\*---------------------------------------------------------------------------*/ 																
FoamFile																
{																
    version     2.0;																
    format      ascii;																
    class       dictionary;																
    object      blockMeshDict;																
}																
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //																
convertToMeters	1	;														
																
geometry																
{																
}																
																
vertices																
(																
	(	0	0	0	)	//	0									
	(	1	0	0	)	//	1									
	(	1	50	0	)	//	2									
	(	-49	0	0	)	//	3									
	(	0	0	0.3	)	//	4									
	(	1	0	0.3	)	//	5									
	(	1	50	0.3	)	//	6									
	(	-49	0	0.3	)	//	7									
	(	51	8.85605706101345	0	)	//	8									
	(	51	50	0	)	//	9									
	(	51	8.85605706101345	0.3	)	//	10									
	(	51	50	0.3	)	//	11									
	(	1	-50	0	)	//	12									
	(	1	-50	0.3	)	//	13									
	(	51	-50	0	)	//	14									
	(	51	-50	0.3	)	//	15									
	(	1	0	0	)	//	16									
	(	1	0	0.3	)	//	17									
																
);																
																
																
blocks																
(																
	hex	(0	1	2	3	4	5	6	7)	(	48	219	1	)	//block	1
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	(															
(	0.4	0.583333333333333	2	)												
(	0.6	0.416666666666667	1	)												
	)															
	0.025	0.025														
	(															
(	0.4	0.583333333333333	2	)												
(	0.6	0.416666666666667	1	)												
	)															
	//	y-direction	expansion	ratio												
	(															
(	0.01	0.155251141552511	25.5476698618767	)												
(	0.99	0.844748858447489	15.6570052048816	)												
	)															
	(															
(	0.01	0.155251141552511	25.5476698618767	)												
(	0.99	0.844748858447489	15.6570052048816	)												
	)															
	(															
(	0.01	0.155251141552511	25.5476698618767	)												
(	0.99	0.844748858447489	15.6570052048816	)												
	)															
	(															
(	0.01	0.155251141552511	25.5476698618767	)												
(	0.99	0.844748858447489	15.6570052048816	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
																
	hex	(1	8	9	2	5	10	11	6)	(	238	219	1)	//block	2	
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	40	40	40	40												
	//	y-direction	expansion	ratio												
	(															
(	0.01	0.155251141552511	25.5476698618767	)												
(	0.99	0.844748858447489	15.6570052048816	)												
	)															
	18.5345088641572	18.5345088641572														
	(															
(	0.01	0.155251141552511	25.5476698618767	)												
(	0.99	0.844748858447489	15.6570052048816	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
																
	hex	(3	12	16	0	7	13	17	4)	(	48	219	1	)	//block	3
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	0.025															
	(															
(	0.4	0.583333333333333	2	)												
(	0.6	0.416666666666667	1	)												
	)															
	(															
(	0.4	0.583333333333333	2	)												
(	0.6	0.416666666666667	1	)												
	)															
	0.025															
	//	y-direction	expansion	ratio												
	(															
(	0.99	0.844748858447489	0.063869174654692	)												
(	0.01	0.155251141552511	0.039142513012204	)												
	)															
	(															
(	0.99	0.844748858447489	0.063869174654692	)												
(	0.01	0.155251141552511	0.039142513012204	)												
	)															
	(															
(	0.99	0.844748858447489	0.063869174654692	)												
(	0.01	0.155251141552511	0.039142513012204	)												
	)															
	(															
(	0.99	0.844748858447489	0.063869174654692	)												
(	0.01	0.155251141552511	0.039142513012204	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
																
																
																
																
																
	hex	(12	14	8	16	13	15	10	17)	(	238	219	1)	//block	4	
	edgeGrading															
	(															
	//	x-direction	expansion	ratio												
	40	40	40	40												
	//	y-direction	expansion	ratio												
	(															
(	0.99	0.844748858447489	0.063869174654692	)												
(	0.01	0.155251141552511	0.039142513012204	)												
	)															
	0.053953412379534	0.053953412379534														
	(															
(	0.99	0.844748858447489	0.063869174654692	)												
(	0.01	0.155251141552511	0.039142513012204	)												
	)															
																
	//	z-direction	expansion	ratio												
	1	1	1	1												
	)															
);																
																
																
edges																
(																
	arc	3 2	(	-34.3553390593274	35.3553390593274	0	)									
	arc	7 6 	(	-34.3553390593274	35.3553390593274	0.3	)									
																
	spline	1	0													
	(															
	(	0.999013364214136	0.001603195813071	0	)											
	(	0.996057350657239	0.002001639857	0	)											
	(	0.991143625364344	0.002661910057587	0	)											
	(	0.984291580564316	0.003578329983451	0	)											
	(	0.975528258147577	0.004743009338462	0	)											
	(	0.964888242944125	0.006145900559515	0	)											
	(	0.95241352623301	0.00777487142898	0	)											
	(	0.938153340021932	0.009615793586495	0	)											
	(	0.922163962751008	0.011652646800853	0	)											
	(	0.904508497187474	0.013867638839508	0	)											
	(	0.885256621387894	0.016241340750497	0	)											
	(	0.864484313710706	0.018752837348913	0	)											
	(	0.842273552964344	0.021379892676769	0	)											
	(	0.818711994874345	0.024099130180163	0	)											
	(	0.793892626146236	0.026886227319582	0	)											
	(	0.767913397489498	0.02971612429593	0	)											
	(	0.740876837050858	0.032563246533647	0	)											
	(	0.712889645782536	0.035401740509435	0	)											
	(	0.684062276342339	0.038205722445814	0	)											
	(	0.654508497187474	0.040949539296834	0	)											
	(	0.624344943582427	0.043608041330927	0	)											
	(	0.593690657292862	0.046156865453224	0	)											
	(	0.562666616782152	0.048572733377221	0	)											
	(	0.531395259764657	0.050834227181931	0	)											
	(	0.5	0.052915500024953	0	)											
	(	0.468604740235343	0.054787982461447	0	)											
	(	0.437333383217848	0.056422929731291	0	)											
	(	0.406309342707138	0.057791454802788	0	)											
	(	0.375655056417573	0.058864532453555	0	)											
	(	0.345491502812526	0.059612962718559	0	)											
	(	0.315937723657661	0.060007276603476	0	)											
	(	0.287110354217464	0.060017558309513	0	)											
	(	0.259123162949142	0.059613144031998	0	)											
	(	0.232086602510502	0.058769819286224	0	)											
	(	0.206107373853763	0.057574542188263	0	)											
	(	0.181288005125655	0.056048036378242	0	)											
	(	0.157726447035656	0.054173499599515	0	)											
	(	0.135515686289294	0.051933568331356	0	)											
	(	0.114743378612105	0.049309595024754	0	)											
	(	0.095491502812526	0.046280389687299	0	)											
	(	0.077836037248993	0.042819940786342	0	)											
	(	0.061846659978068	0.038893032510095	0	)											
	(	0.04758647376699	0.034549732719673	0	)											
	(	0.035111757055874	0.03004118167754	0	)											
	(	0.024471741852423	0.02538508249403	0	)											
	(	0.015708419435685	0.020584044030037	0	)											
	(	0.008856374635656	0.015641168501903	0	)											
	(	0.003942649342761	0.010560054875767	0	)											
	(	0.000986635785864	0.005344800363668	0	)											
	)															
																
																
	spline	5	4													
	(															
	(	0.999013364214136	0.001603195813071	0.3	)											
	(	0.996057350657239	0.002001639857	0.3	)											
	(	0.991143625364344	0.002661910057587	0.3	)											
	(	0.984291580564316	0.003578329983451	0.3	)											
	(	0.975528258147577	0.004743009338462	0.3	)											
	(	0.964888242944125	0.006145900559515	0.3	)											
	(	0.95241352623301	0.00777487142898	0.3	)											
	(	0.938153340021932	0.009615793586495	0.3	)											
	(	0.922163962751008	0.011652646800853	0.3	)											
	(	0.904508497187474	0.013867638839508	0.3	)											
	(	0.885256621387894	0.016241340750497	0.3	)											
	(	0.864484313710706	0.018752837348913	0.3	)											
	(	0.842273552964344	0.021379892676769	0.3	)											
	(	0.818711994874345	0.024099130180163	0.3	)											
	(	0.793892626146236	0.026886227319582	0.3	)											
	(	0.767913397489498	0.02971612429593	0.3	)											
	(	0.740876837050858	0.032563246533647	0.3	)											
	(	0.712889645782536	0.035401740509435	0.3	)											
	(	0.684062276342339	0.038205722445814	0.3	)											
	(	0.654508497187474	0.040949539296834	0.3	)											
	(	0.624344943582427	0.043608041330927	0.3	)											
	(	0.593690657292862	0.046156865453224	0.3	)											
	(	0.562666616782152	0.048572733377221	0.3	)											
	(	0.531395259764657	0.050834227181931	0.3	)											
	(	0.5	0.052915500024953	0.3	)											
	(	0.468604740235343	0.054787982461447	0.3	)											
	(	0.437333383217848	0.056422929731291	0.3	)											
	(	0.406309342707138	0.057791454802788	0.3	)											
	(	0.375655056417573	0.058864532453555	0.3	)											
	(	0.345491502812526	0.059612962718559	0.3	)											
	(	0.315937723657661	0.060007276603476	0.3	)											
	(	0.287110354217464	0.060017558309513	0.3	)											
	(	0.259123162949142	0.059613144031998	0.3	)											
	(	0.232086602510502	0.058769819286224	0.3	)											
	(	0.206107373853763	0.057574542188263	0.3	)											
	(	0.181288005125655	0.056048036378242	0.3	)											
	(	0.157726447035656	0.054173499599515	0.3	)											
	(	0.135515686289294	0.051933568331356	0.3	)											
	(	0.114743378612105	0.049309595024754	0.3	)											
	(	0.095491502812526	0.046280389687299	0.3	)											
	(	0.077836037248993	0.042819940786342	0.3	)											
	(	0.061846659978068	0.038893032510095	0.3	)											
	(	0.04758647376699	0.034549732719673	0.3	)											
	(	0.035111757055874	0.03004118167754	0.3	)											
	(	0.024471741852423	0.02538508249403	0.3	)											
	(	0.015708419435685	0.020584044030037	0.3	)											
	(	0.008856374635656	0.015641168501903	0.3	)											
	(	0.003942649342761	0.010560054875767	0.3	)											
	(	0.000986635785864	0.005344800363668	0.3	)											
	)															
																
																
	arc	3 12	(	-34.3553390593274	-35.3553390593274	0	)									
	arc	7 13	(	-34.3553390593274	-35.3553390593274	0.3	)									
																
	spline	0	16													
	(															
	(	0.000986635785864	-0.005582507235849	0	)											
	(	0.003942649342761	-0.010968397457867	0	)											
	(	0.008856374635656	-0.016153204004338	0	)											
	(	0.015708419435685	-0.021133220645174	0	)											
	(	0.024471741852423	-0.02590549967273	0	)											
	(	0.035111757055874	-0.030467847048111	0	)											
	(	0.04758647376699	-0.034818814638403	0	)											
	(	0.061846659978068	-0.038920337680537	0	)											
	(	0.077836037248993	-0.042655944617135	0	)											
	(	0.095491502812526	-0.046028892902703	0	)											
	(	0.114743378612105	-0.049050410781835	0	)											
	(	0.135515686289294	-0.051730975282323	0	)											
	(	0.157726447035656	-0.054081011925821	0	)											
	(	0.181288005125655	-0.056111263187963	0	)											
	(	0.206107373853763	-0.057832982440116	0	)											
	(	0.232086602510502	-0.059151664184168	0	)											
	(	0.259123162949142	-0.059914716370658	0	)											
	(	0.287110354217464	-0.060196970544998	0	)											
	(	0.315937723657661	-0.0600598900101	0	)											
	(	0.345491502812526	-0.059552916085549	0	)											
	(	0.375655056417573	-0.058717870889876	0	)											
	(	0.406309342707138	-0.057591542668822	0	)											
	(	0.437333383217848	-0.056207271758376	0	)											
	(	0.468604740235343	-0.054595954106482	0	)											
	(	0.5	-0.052786688939284	0	)											
	(	0.531395259764657	-0.050801247952743	0	)											
	(	0.562666616782152	-0.048610486210703	0	)											
	(	0.593690657292862	-0.046230794499244	0	)											
	(	0.624344943582427	-0.043693213583757	0	)											
	(	0.654508497187474	-0.04102862347289	0	)											
	(	0.684062276342339	-0.038267595927308	0	)											
	(	0.712889645782536	-0.035440249875311	0	)											
	(	0.740876837050858	-0.032576110149224	0	)											
	(	0.767913397489498	-0.029703969983125	0	)											
	(	0.793892626146236	-0.026851757727116	0	)											
	(	0.818711994874345	-0.024046408238778	0	)											
	(	0.842273552964344	-0.021313739410589	0	)											
	(	0.864484313710706	-0.018678334284323	0	)											
	(	0.885256621387894	-0.016163429190917	0	)											
	(	0.904508497187474	-0.01379080833771	0	)											
	(	0.922163962751008	-0.011580705244987	0	)											
	(	0.938153340021932	-0.009551711410857	0	)											
	(	0.95241352623301	-0.007720692558069	0	)											
	(	0.964888242944125	-0.006102712788769	0	)											
	(	0.975528258147577	-0.004710966943674	0	)											
	(	0.984291580564316	-0.003556721430974	0	)											
	(	0.991143625364344	-0.002649263757677	0	)											
	(	0.996057350657239	-0.00199586096231	0	)											
	(	0.999013364214136	-0.001601727113085	0	)											
	)															
																
																
	spline	4	17													
	(															
	(	0.000986635785864	-0.005582507235849	0.3	)											
	(	0.003942649342761	-0.010968397457867	0.3	)											
	(	0.008856374635656	-0.016153204004338	0.3	)											
	(	0.015708419435685	-0.021133220645174	0.3	)											
	(	0.024471741852423	-0.02590549967273	0.3	)											
	(	0.035111757055874	-0.030467847048111	0.3	)											
	(	0.04758647376699	-0.034818814638403	0.3	)											
	(	0.061846659978068	-0.038920337680537	0.3	)											
	(	0.077836037248993	-0.042655944617135	0.3	)											
	(	0.095491502812526	-0.046028892902703	0.3	)											
	(	0.114743378612105	-0.049050410781835	0.3	)											
	(	0.135515686289294	-0.051730975282323	0.3	)											
	(	0.157726447035656	-0.054081011925821	0.3	)											
	(	0.181288005125655	-0.056111263187963	0.3	)											
	(	0.206107373853763	-0.057832982440116	0.3	)											
	(	0.232086602510502	-0.059151664184168	0.3	)											
	(	0.259123162949142	-0.059914716370658	0.3	)											
	(	0.287110354217464	-0.060196970544998	0.3	)											
	(	0.315937723657661	-0.0600598900101	0.3	)											
	(	0.345491502812526	-0.059552916085549	0.3	)											
	(	0.375655056417573	-0.058717870889876	0.3	)											
	(	0.406309342707138	-0.057591542668822	0.3	)											
	(	0.437333383217848	-0.056207271758376	0.3	)											
	(	0.468604740235343	-0.054595954106482	0.3	)											
	(	0.5	-0.052786688939284	0.3	)											
	(	0.531395259764657	-0.050801247952743	0.3	)											
	(	0.562666616782152	-0.048610486210703	0.3	)											
	(	0.593690657292862	-0.046230794499244	0.3	)											
	(	0.624344943582427	-0.043693213583757	0.3	)											
	(	0.654508497187474	-0.04102862347289	0.3	)											
	(	0.684062276342339	-0.038267595927308	0.3	)											
	(	0.712889645782536	-0.035440249875311	0.3	)											
	(	0.740876837050858	-0.032576110149224	0.3	)											
	(	0.767913397489498	-0.029703969983125	0.3	)											
	(	0.793892626146236	-0.026851757727116	0.3	)											
	(	0.818711994874345	-0.024046408238778	0.3	)											
	(	0.842273552964344	-0.021313739410589	0.3	)											
	(	0.864484313710706	-0.018678334284323	0.3	)											
	(	0.885256621387894	-0.016163429190917	0.3	)											
	(	0.904508497187474	-0.01379080833771	0.3	)											
	(	0.922163962751008	-0.011580705244987	0.3	)											
	(	0.938153340021932	-0.009551711410857	0.3	)											
	(	0.95241352623301	-0.007720692558069	0.3	)											
	(	0.964888242944125	-0.006102712788769	0.3	)											
	(	0.975528258147577	-0.004710966943674	0.3	)											
	(	0.984291580564316	-0.003556721430974	0.3	)											
	(	0.991143625364344	-0.002649263757677	0.3	)											
	(	0.996057350657239	-0.00199586096231	0.3	)											
	(	0.999013364214136	-0.001601727113085	0.3	)											
	)															
																
																
);																
																
faces																
(																
																
);																
																
faces																
(																
  																
);																
																
																
defaultPatch																
{																
    name frontAndBack;																
    type empty;																
}																
																
boundary																
(																
inlet              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (9 2 6 11)  // block face in this patch																
                (2 3 7 6  )  // block face in this patch																
                (3 12 13 7  )  // block face in this patch																
                (12 15 14 13  )  // block face in this patch																
            );																
        } 																
																
outlet              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (8 9 10 11)  // block face in this patch																
                (15 8 10 14  )  // block face in this patch																
            );																
        }																
																
walls              // patch name																
        {																
            type wall;    // patch type for patch 0																
            faces																
            (																
                (0 1 5 4)  // block face in this patch																
                (0 4 17 16  )  // block face in this patch																
            );																
        } 																
																
interface1              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (1 8 10 5)  // block face in this patch																
            );																
        } 																
interface2              // patch name																
        {																
            type patch;    // patch type for patch 0																
            faces																
            (																
                (16 17 10 8)  // block face in this patch																
            );																
        } 																
);																
																
 mergePatchPairs																
(																
    ( interface1 interface2 ) 																
);																
// ************************************************************************* //																

